lib/data/wsdl.xml

<?xml version='1.0' encoding='UTF-8'?>
<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1 (UNKNOWN_BRANCH-false; 2015-01-15T16:53:43+0100) JAXWS-RI/2.2.10 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1 (UNKNOWN_BRANCH-false; 2015-01-15T16:53:43+0100) JAXWS-RI/2.2.10 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://rim2.ist.com/rim2/v1/service" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://rim2.ist.com/rim2/v1/service" name="RimService">
    <wsp1_2:Policy xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" xmlns:ssp="http://schemas.sun.com/2006/03/wss/server" xmlns:sunwsp="http://java.sun.com/xml/ns/wsit/policy" wsu:Id="HentDataForArkivering_policy">
        <sp:SupportingTokens>
            <wsp1_2:Policy>
                <sp:UsernameToken sp:IncludeToken=".../IncludeToken/AlwaysToRecipient"/>
            </wsp1_2:Policy>
        </sp:SupportingTokens>

    </wsp1_2:Policy>
    <types>
        <xsd:schema>
            <xsd:import namespace="http://rim2.ist.com/rim2/v1/service" schemaLocation="https://vigo.dummy.allthethings.win/RimService?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="LagreStatusArkiverteData">
        <part name="parameters" element="tns:LagreStatusArkiverteData"/>
    </message>
    <message name="LagreStatusArkiverteDataResponse">
        <part name="parameters" element="tns:LagreStatusArkiverteDataResponse"/>
    </message>
    <message name="HentDataForArkivering">
        <part name="parameters" element="tns:HentDataForArkivering"/>
    </message>
    <message name="HentDataForArkiveringResponse">
        <part name="parameters" element="tns:HentDataForArkiveringResponse"/>
    </message>
    <portType name="RimService">
        <operation name="LagreStatusArkiverteData">
            <input wsam:Action="http://rim2.ist.com/rim2/v1/service/RimService/LagreStatusArkiverteDataRequest" message="tns:LagreStatusArkiverteData"/>
            <output wsam:Action="http://rim2.ist.com/rim2/v1/service/RimService/LagreStatusArkiverteDataResponse" message="tns:LagreStatusArkiverteDataResponse"/>
        </operation>
        <operation name="HentDataForArkivering">
            <input wsam:Action="http://rim2.ist.com/rim2/v1/service/RimService/HentDataForArkiveringRequest" message="tns:HentDataForArkivering"/>
            <output wsam:Action="http://rim2.ist.com/rim2/v1/service/RimService/HentDataForArkiveringResponse" message="tns:HentDataForArkiveringResponse"/>
        </operation>
    </portType>
    <binding name="RimServicePortBinding" type="tns:RimService">
        <wsp1_2:PolicyReference URI="#HentDataForArkivering_policy"/>
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="LagreStatusArkiverteData">
            <soap12:operation soapAction=""/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
        <operation name="HentDataForArkivering">
            <soap12:operation soapAction=""/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="RimService">
        <port name="RimServicePort" binding="tns:RimServicePortBinding">
            <soap12:address location="https://vigo.dummy.allthethings.win/RimService"/>
        </port>
    </service>
</definitions>